let codeJson = {
  "1":{
    errmsg: "网络错误",
    viewMsg: "网络错误"
  },
  "200": {
    errmsg: "发送用户信息失败！",
    viewMsg: "发送用户信息失败！"
  },
  "201": {
    errmsg: "验证码不正确，请重新输入！",
    viewMsg: "验证码不正确，请重新输入！"
  },
  "203": {
    errmsg: "请输入验证码,重新登录!",
    viewMsg: "请输入验证码,重新登录!"
  },
  "204": {
    errmsg: "验证码不正确，请重新输入！",
    viewMsg: "请输入验证码,重新登录!"
  },
  "400": {
    errmsg: "发送用户信息失败！",
    viewMsg: "发送用户信息失败！"
  },
  "403": {
    errmsg: "验证码输入不正确",
    viewMsg:"验证码输入不正确"
  },
  "510": {
    errmsg: "验证码输入不正确",
    viewMsg:"验证码输入不正确"
  },
  "508": {
    errmsg: "手机号输入不正确",
    viewMsg:"手机号输入不正确"
  },
  "527": {
    errmsg: "当前修改密码手机号不匹配验证码接收短信用户",
    viewMsg:"当前修改密码手机号不匹配验证码接收短信用户"
  },
  "40000": {
    errmsg: "扫码失败",
    viewMsg: "扫码失败，请重新扫码"
  },
  "40001": {
    errmsg: "网络错误",
    viewMsg: "已断开与互联网的连接"
  },
  "40002": {
    errmsg: "发送验证码失败",
    viewMsg: "发送失败，请点击重新发送"
  },
  "40003": {
    errmsg: "发送二维码失败",
    viewMsg: "二维码失效，请重新扫码"
  },
  "40004": {
    errmsg: "二维码超时",
    viewMsg: "二维码超时，请重新扫码"
  },
  "40005": {
    errmsg: "二维码已经被扫描",
    viewMsg: "二维码失效，请重新扫码"
  },
  "40006": {
    errmsg: "登录失败！",
    viewMsg: "登录失败，请确认手机号和验证码是否正确"
  },
  "40007": {
    errmsg: "获取用户信息失败",
    viewMsg: "登录失败，请重新登录"
  },
  "40008": {
    errmsg: "获取班级列表失败!",
    viewMsg: "获取信息失败，请下拉刷新!"
  },
  "40009": {
    errmsg: "获取班级列表失败!",
    viewMsg: "获取信息失败，请下拉刷新!"
  },
  "40010": {
    errmsg: "获取学生列表失败!",
    viewMsg: "获取信息失败，请下拉刷新!"
  },
  "40011": {
    errmsg: "获取签到列表失败",
    viewMsg: "获取信息失败，请下拉刷新!"
  },
  "40012": {
    errmsg: "绑定答题器失败",
    viewMsg: "绑定答题器失败，请重新点击开始绑定按钮"
  },
  "40013": {
    errmsg: "替换答题器失败",
    viewMsg: "替换答题器失败，请重新点击替换按钮"
  },
  "40014": {
    errmsg: "获取课次列表失败",
    viewMsg: "获取课次列表失败，请点击刷新"
  },
  "40015": {
    errmsg: "创建二维码失败",
    viewMsg: "二维码创建失败"
  },
  "40016": {
    errmsg: "token验证失败",
    viewMsg: "请重新登录"
  },
  "40017": {
    errmsg: "扫描二维码超时!",
    viewMsg: "已超时，请重新扫码"
  },
  "40018": {
    errmsg: "二维码未被扫描!",
    viewMsg: "请扫码二维码"
  },
  "40019": {
    errmsg: "用户信息不存在!",
    viewMsg: "请使用提供给加盟校的手机号"
  },
  "40020": {
    errmsg: "生成验证码失败!",
    viewMsg: "生成验证码失败，请点击重新发送"
  },
  "40021": {
    errmsg: "验证码无效",
    viewMsg: "验证码无效，请点击重新发送"
  },
  "40022": {
    errmsg: "获取用户信息失败",
    viewMsg: "请使用提供给加盟校的手机号"
  },
  "40023": {
    errmsg: "调用短信接口出错！",
    viewMsg: "验证码短信发送失败，请点击重新发送"
  },
  "40024": {
    errmsg: "验证码超时！",
    viewMsg: "验证码超时，请点击重新发送！"
  },
  "40025": {
    errmsg: "查询验证码失败",
    viewMsg: "查询验证码失败，请点击重新发送"
  },
  "40026": {
    errmsg: "该用户不存在",
    viewMsg: "使用提供给加盟校的手机号"
  },
  "41000": {
    errmsg: "参数错误",
    viewMsg: "参数传递错误"
  },
  "40101": {
    errmsg: "获取菜单列表失败",
    viewMsg: "获取菜单列表失败"
  },
  "40102": {
    errmsg: "发送题目失败",
    viewMsg: "发送题目失败"
  },
  "40103": {
    errmsg: "执行回执失败",
    viewMsg: "执行回执失败"
  },
  "40104": {
    errmsg: "未查询到该题目",
    viewMsg: "未查询到该题目"
  },
  "40105": {
    errmsg: "存储答题信息失败",
    viewMsg: "存储答题信息失败"
  },
  "40106": {
    errmsg: "未查询到数据",
    viewMsg: "未查询到数据"
  },
  "40107": {
    errmsg: "发送下课反馈信息失败",
    viewMsg: "发送下课反馈信息失败"
  },
  "40108": {
    errmsg: "发未找到该班级下的答题器",
    viewMsg: "发未找到该班级下的答题器"
  },
  "40109": {
    errmsg: "未查询到该题目",
    viewMsg: "未查询到该题目"
  },
  "40110": {
    errmsg: "传送答题信息失败",
    viewMsg: "传送答题信息失败"
  },
  "40111": {
    errmsg: "开始上课失败",
    viewMsg: "开始上课失败"
  },
  "40112": {
    errmsg: "获取已开课时长失败(课程未开始或已结束)",
    viewMsg: "获取已开课时长失败(课程未开始或已结束)"
  },
  "40113": {
    errmsg: "添加app版本失败",
    viewMsg: "添加app版本失败"
  },
  "40114": {
    errmsg: "未找到app版本信息",
    viewMsg: "未找到app版本信息"
  },
  "40115": {
    errmsg: "发送红包互动失败",
    viewMsg: "发送红包互动失败"
  },
  "40116": {
    errmsg: "上传文件失败",
    viewMsg: "上传文件失败"
  },
  "40117": {
    errmsg: "结束上课失败",
    viewMsg: "结束上课失败"
  },
  "40118": {
    errmsg: "发送失败",
    viewMsg: "发送失败"
  },
  "40119": {
    errmsg: "未查询到有对应课程",
    viewMsg: "未查询到有对应课程"
  },
  "40120": {
    errmsg: "已经发送过反馈",
    viewMsg: "已经发送过反馈"
  },
  "40121": {
    errmsg: "密码错误",
    viewMsg: "密码错误"
  },
  "40122": {
    errmsg: "更改密码失败",
    viewMsg: "更改密码失败"
  },
  "40123": {
    errmsg: "旧密码与新密码相同",
    viewMsg: "旧密码与新密码相同"
  },
  "40124": {
    errmsg: "开课时间未到",
    viewMsg: "开课时间未到"
  },
  "40029": {
    errmsg:"该学校名称已被占用",
    viewMsg:"该学校名称已被占用"
  },
  "50000": {
    errmsg: "错误二维码",
    viewMsg: "请扫描校果教育双师课堂二维码"
  },
  "50001": {
    errmsg: "错误二维码",
    viewMsg: "请扫描校果教育双师课堂二维码"
  },
  "40201": {
    errmsg: "参数错误",
    viewMsg: "密码错误，请重新输入!"
  },
  "40202":{
    errmsg: "参数错误",
    viewMsg: "用户名错误，请重新登录!"
  },
  "50002":{
    errmsg: "手机号错误",
    viewMsg: "未匹配的手机号"
  },
  "40127":{
    errmsg: "没有查询到班级准备就绪",
    viewMsg: "没有查询到班级准备就绪"
  },
  "1002":{
    errmsg: "EXIST_COUNT_DOWN",
    viewMsg: "已经存在倒计时"
  },
  "1004":{
    errmsg: "device_list_is_empty",
    viewMsg: "没有终端连接"
  },
  "1005":{
    errmsg: "class_not_connect",
    viewMsg: "班级未连接"
  },




};
export default codeJson;
// module.exports = {
//   codeJson: codeJson
// }